{"pages":[{"title":"Documentation","text":"Useful notes TerminalbashfindExplosion of files ssh","link":"/docs/index.html"},{"title":"Windows","text":"","link":"/windows/index.html"},{"title":"tags","text":"","link":"/tags/index.html"},{"title":"About","text":"Another digital journal; about computer languages and operating systems — and sometimes hardware. Life tipWhen action grows unprofitable, gather information; when information grows unprofitable, sleep. — Ursula K. Le Guin, The Left Hand of Darkness","link":"/about/index.html"},{"title":"Linux","text":"Supermicro configuration Debian preseed","link":"/linux/index.html"},{"title":"macOS","text":"","link":"/macos/index.html"}],"posts":[{"title":"Broken images","text":"Seems like the images are hitting too fast which triggers a rate limit. What to do? I mean where should I add these images. I will have to adjust this theme. I like static sites but I don’t like how it recalls every resource. Another todo; they are quickly adding up. Photo by Math","link":"/2019/06/25/brokenimages/"},{"title":"Completely overwhelmed","text":"Creating a todo list today. I need to get some projects off of my mind and focus on what projects I shouldn’t be starting or serve as a distraction. It all started when I seen the raspberry pi today. It looks so lonely. So, I have decided to start some fall cleaning sweeping: removing unused equipment away from eye sight. I am not currently using the raspberry so it would be best to clear it away. Speaking of clearing away, now that summer is officially done, 2019 is quickly coming to an end. We are entering the last quarter. So sorry raspberry. Same to you networking. Must finish off strong! Back to Linux+ for the rest of the year! The Goal for 2019 Complete CompTIA Linux+ Start CompTIA A+ The Goal for 2020 Start CCNA R/S","link":"/2019/09/30/completelyoverwhelmed/"},{"title":"Debian buster","text":"Debian buster was released! I will give it a try today.","link":"/2019/07/07/debianbuster/"},{"title":"macOS console messages","text":"A small reminder to myself. I did something I instantly regretted: I opened the macOS console. The logs read fsctl error some thing some thing space deleted cache something. I “fixed” it by turning off istats disk monitor.","link":"/2019/07/22/consolemessages/"},{"title":"C++ loop; A day counter","text":"How to count days from today in a loop. I need to count the days from today. So if today was Monday and I wantedto advanced 342 days, what day would it land on? Sunday. Photo by Crissy Jarvis","link":"/2019/05/18/daycounter/"},{"title":"Debian preseed","text":"Creating a custom debian derivative - simple-cdd","link":"/2019/04/16/debianpreseed/"},{"title":"How to delete 1 Million+ files","text":"Problem: rm complains “Argument list too long” when trying to delete 1 million files. Solution: run the find command.Why: working on a new clean up script. Photo by Carles Rabada","link":"/2019/04/27/delete1m/"},{"title":"Different file extensions","text":"A clean up script was hanging for “no apparent reason”. After reviewing the script it happen to be a difference in file extensions. The script was looking for dot md extensions while the current file being read was a dot markdown. I suppose some error checking would of helped. I renamed all the dot markdown to dot md files. I thought I had done this already. Oh well, it seems to work now.","link":"/2019/07/20/differentfileextensions/"},{"title":"Easy install Ubuntu 19.10","text":"Just installed Ubuntu 19.10 via VMware easy install. The reason behind the installation is for practice labs. Ubuntu 19.10 might be a little too new for practice labs but we will see. Speaking of seeing, watch me set and unset an environment variable on the newly installed OS! BONUS: the output of set and export are sent through named pipes.","link":"/2019/10/26/easyinstallubuntu1910/"},{"title":"Editors like vi, vim and nano","text":"This week is all about editors: I am studying nano and vim. I do not have much to report on besides that. I already know most of the basics in regards to vim. Nano — I know nothing. Most of the commands are at the bottom but in order to prepare myself for compTIA’s Linux+ I really should know them both like the back of my hand; I really don’t know what the back of my hand looks like but I hope that makes sense. Actually, I write all my blog post in vim. Ever since my first post — all in vim. All my studying is done in GNU Emacs. I am thankful they don’t test for GNU Emacs because the learning curve on that one, at least for me, is very steep; I constantly have a cheat sheet near by every time I open it. Which is always because it is a program that is always open on my system.","link":"/2019/10/09/editorslikevi,vimandnano/"},{"title":"End of the month","text":"I had a record number of post this month! This would be my twelfth post in the month of June. I have changed the layout and added images and everything seems to be working. As July comes around I will work on internal modifications. I would also like to start some home automation and raspberry pi projects. I am thinking about getting a raspberry pi 4 but only after I utilized the one I will be working on first. It would be nice to rush out and have one laying around but that is not very useful. I currently have a few ideas write down in my journal and many things I would like to accomplish but I need to squeeze the clock for some more time. Until then, I keep the back burners warm.","link":"/2019/06/30/endofthemonth/"},{"title":"End of month","text":"It is the end of the month; and when I look back, I can proudly say that I have come a long way in regards to coding, reading and developing a new perception. I suppose that is the purpose of learning something new: to obtain a new perception. Well, the summer is coming to an end and I would say it is time to give a little more effort as a way to finish off strong. Lets push and finish the summer of 2019!","link":"/2019/07/31/endofmonth/"},{"title":"Entanglement of languages","text":"When I stop to think, I wonder if I have lost my — mind. The goal was to move from Jekyll, a Ruby based framework, to Hexo, a JavaScript based framework; the reasoning behind this was to familiarize myself with JavaScript. I completed the transition; not so much the familiarization. The main question, that has me questioning myself today, is “am I really entangling JavaScript, Python and Bash?”. Well, yes and no: I was moving some of my scripts, from Bash to Python, and now I have a mixed sort of scripts in all three languages. I never thought I’d see the day. The scary part is that I think I am starting to like it!","link":"/2019/08/10/entanglement/"},{"title":"Github remote configuration","text":"Here are some git commands I seem to forget. Having them near by helps. 12345678910111213141516171819202122git checkout -b feature OR git branch feature# list branchesgit branch# push to remotegit push --set-upstream origin feature# delete remote branchgit push origin --delete feature/login# delete master branch after pushgit push origin +master# delete local branch (merged branch)git branch -d# delete local branch (unmerged branch)git branch -D# view remote branchesgit remote show origingit branch -r Delete remote branch1git push origin --delete branchName Git ignore if it is not working 123rm -r --cached .git add .git commit -m \".gitignore is now working\" View Remote Files1git ls-tree -r --name-only &lt;commit&gt; (where instead of &lt;commit&gt; there can be &lt;branch&gt;). Gist123456789git init helloWorldecho \"Hello World\" &gt; Hello.shgit add .git commit -m \"init\"gist -p -d \"test\" Hello.shgit remote add origin git@github.com:ID.gitgit pullgit reset --hard origin/mastergit push -u origin master","link":"/2019/06/26/githubremote/"},{"title":"Finally","text":"Well, not quite. I have a few more rough edges to polish.","link":"/2019/08/22/finally/"},{"title":"Environment Variables","text":"I am making good progress! Linux+ here I come! Lets hope the trough of disillusionment doesn’t happen. There are four types of variables. Environment - Has inheritance and generated by system settings.export FRUIT=&quot;orange&quot; # Environment Shell - Has no inheritance and generated by shell startup scripts.FRUIT=&quot;orange&quot; # Shell User - Defined on the command prompt and defined in user profiles.fruit=&quot;orange&quot; # User/Local to the shell prompt Local - Defined in script functions.fruit=&quot;orange&quot; # Local The commands in the imageSearched for the environment variable called FRUIT; not found.FRUIT is defined and exported.Searched again and found.Spawned a child shell.Searched again and found.","link":"/2019/10/05/environmentvariables/"},{"title":"Git recovery","text":"A smaller reminder. If you rebase/squash, and reset hard, you will lose your important addition; use git reflog to recover. The commit “Important addition.” was at HEAD@{3}. 12345git add &amp;&amp; git commit -am \"Important addition.\"git rebase -i HEAD~3 # did a squashgit reset --hard HEAD~2git refloggit reset --hard HEAD@{3}","link":"/2019/09/01/gitrecovery/"},{"title":"Battle of the Hello Worlds","text":"Which computer langauge runs the fastest? Lets ask the computer. Who is the fastest of them all? 123for i in $(find . ! -name \"*.js\" -print | sort);\\do echo \"From: $i\" &gt;&gt; ../fastest; {time ./$i;} 2&gt;&gt; ../fastest; echo \" \"; \\done &amp;&amp; i=jsApp.js; echo \"From: $i\" &gt;&gt; ../fastest;{time node ./$i} 2&gt;&gt; ../fastest; cat ../fastest This is what the computer said. From fastest to slowest: {Bash, C, C++} Swift compiled, Python, Swift as script, and JavaScript. 123456789101112131415From: .From: ./bashScript.sh./$i 0.00s user 0.00s system 71% cpu 0.004 totalFrom: ./cPlus./$i 0.00s user 0.00s system 56% cpu 0.004 totalFrom: ./cProgram./$i 0.00s user 0.00s system 56% cpu 0.004 totalFrom: ./pythonProgram.py./$i 0.03s user 0.01s system 85% cpu 0.048 totalFrom: ./swiftApp./$i 0.01s user 0.00s system 80% cpu 0.014 totalFrom: ./swiftApp.swift./$i 0.03s user 0.02s system 85% cpu 0.064 totalFrom: jsApp.jsnode ./$i 0.08s user 0.02s system 92% cpu 0.105 total BonusWho spends the most cpu time xx%? From least to most talkative: {C, C++}, Bash, Swift compiled, {Python, Swift as Script} and JavaScript. Code Photo by Taylor Vick","link":"/2019/05/23/helloworlds/"},{"title":"Why is it so hard to choose","text":"Everything time I have to choose between KDE or Gnome I freeze. I like both but let me take an honest second to pick. I always go with KDE. I like the foot but why do I always go KDE? There is something about it that I can not quite grasp. Is it the layout? Maybe. Is it the macOS look like themes? Maybe. It has to be the Konsole. What ever it is it just feels different. It is odd how it really does feel different. Windows, macOS and all the GNU/Linux distros have a certain feel to them. I will have to get to the bottom of this feeling. It could be the code. Maybe it is the entanglement between software and hardware. Well, all this gives me an idea for a new post. Battle between the OS’s! With different hardware I am not sure how it will be fair. Fun thought though.","link":"/2019/07/10/hardtochoose/"},{"title":"Image test","text":"Does it work? Yes it does! When this site hits the storage limit, I will rethink the image hosting. Right now, the images are hitting firebase, unsplash and github. Why so serious many? I don’t know? I was testing my options. On second thought, I might not need save so many images. I will remove, or rotate, all images from posts that are about a couple weeks old. Photo by Hello I’m Nik 🇬🇧","link":"/2019/06/26/imagetest/"},{"title":"Independence Day","text":"I wanted to do some free coding today but most of my programming time is spent on free coding; also I am trying to build a habit of posting something new every day. I missed two days but I am trying. The hardest part is finding something new to write about.","link":"/2019/07/04/independenceday/"},{"title":"Image search never ends","text":"I am still working on the image search script. What am I doing exactly? I am writing a script to auto insert images. I was scanning my posts for nouns and basing the images off of that; it did not work out so well. The problem was that the nouns were too random. So I opted for a keyword prompt to better match the posts; the prompt is still to random. I will go back to the noun searching script later. Maybe some day I will work on machine learning for better searches — A life goal.","link":"/2019/07/26/imagesearchneverends/"},{"title":"Internet down","text":"Having Internet trouble! Now fixed. It was the coaxial splitter. I need to replace it but for now the cable is connected directly into the wall.","link":"/2019/06/12/internetdown/"},{"title":"Layout change","text":"I have been thinking: I might change my layout — again. Because this week I have visited multiple blogs with two column layouts; and I really like it. One blog that blew my mind was how simple it felt. It had this “slowed downed” feeling to it. This has inspired me to rethink how I write my posts. I plan to start the new style this month. About the new, or changed, layout; I might keep what I have now and just change the code base a bit because that is what we are suppose to do — right? After all, it is feeling a little off the shelf.","link":"/2019/08/09/layoutchange/"},{"title":"Jupyter Hello World","text":"GitHub, Gist, Jupyter. Why not?","link":"/2019/08/23/jupyterhelloworld/"},{"title":"Why I left Jekyll","text":"I was thinking, aka working, on my tags. Then I found Hexo. I stumbled on it via https://www.staticgen.com/. I even found a bash blog on there. I would like to practice some more javascript so I decided to leave ruby and try Hexo. This is what I wanted and it has already been done. So I switched. Photo by nolan-issac","link":"/2019/06/21/leftjekyll/"},{"title":"Lost in cyber space","text":"The Net? Or was it the Web? Shoot maybe it was the cloud? What ever its called to I am sure it will change again.","link":"/2019/02/13/lostinspace/"},{"title":"Learning the usefulness of functions","text":"Coding, for me, is kind of like swimming. Your head goes under code water, then you come back up for air. While underneath, you flow. Not to long ago, like yesterday, I felt really cool: my scripts were getting really long. Then when I was out of the logic water for a while and getting back into the logic water felt like a task; trying to swim in a pool with so many objects. I say all that to say this — I am understanding the importance of functions. I would rather have bite size functions than long winded one shots. I will have to refine these long winded functions into something more manageable. Honestly, somethings it is hard to resist because gluing together shell commands into shell scripts makes me feel like I am doing something importantly great. 123functions(){ # are cool; use more}","link":"/2019/07/25/learningtheusefulnessoffunctions/"},{"title":"My experience with LSD","text":"KDE plasma: Konsole looks strange with lsd. After some reading, it looks like kubuntu ships without the required konsole version.I compiled from source and installed konsole 19.07.70. Now the output of lsd looks fine. ExcerptInstall konsole version 19.07.70","link":"/2019/05/30/lsdexperience/"},{"title":"Local function hiccups","text":"Started the month with a bang hiccup. Images were not loading again. This was due to local variables trying to access global ones. What this really means is that I messed up some bash code. Ugh. Fixed now.","link":"/2019/07/01/localfunction/"},{"title":"Organizing ideas","text":"Lightly going over some todos. Seems like I have to many things on my mind so I will have to do a brain dump either this month or soon. Also I would like to create a new schedule so that I can start up some summer projects. I have a video of my playing with a raspberry pi but I haven’t setup of videos yet. I might wait until mid month to start videos.","link":"/2019/07/02/organizingideas/"},{"title":"Multi line comment","text":"","link":"/2019/02/13/multicomment/"},{"title":"New month new post","text":"Working late on a new post setup. February was my most active month. Watch me beat that with this new setup! Photo by Monica Sauro","link":"/2019/05/01/newmonth/"},{"title":"Python at night","text":"Working on some python classes. Feels like I been MIA for far too long.Why am I writing this site’s “UI” in python and not in node.js/JavaScript? Remember from my last post? I was getting rusty in python so I decided … who am I kidding? I am terrified of js so I am writing my scripts in python. Here is a snippet. 1234567891011121314151617181920212223242526272829303132333435363738394041class NewPost: def __init__(self): print(\"Create a new post.\")class Clean: def __init__(self): print(\"Clean up site images.\")class Edit: def __init__(self): print(\"Edit latest post.\")class Build: def __init__(self): print(\"Build and copy into deployment folder.\")class Unsplash: def __init__(self): print(\"Download unsplash images.\") parser.add_argument('--newpost', action=\"store_true\", help='Create a new post.', default=False) parser.add_argument('--clean', action=\"store_true\", help='Clean up weekly images.', default=False) parser.add_argument('--edit', action=\"store_true\", help='Edit latest post.', default=False) parser.add_argument('--build', action=\"store_true\", help='Build and copy into deployment folder.', default=False) parser.add_argument('--upload', action=\"store_true\", help='Upload to GitHub.', default=False) parser.add_argument('--image', action=\"store_true\", help='Download unsplash image.', default=False) parser.add_argument('--watermark', action=\"store_true\", help='Adding watermark to unsplash image.', default=False) parser.add_argument('--imageformat', action=\"store_true\", help='none replacement.', default=False) The python scriptI’m 170 lines into the script; it is still a work in progress. Once I am done, if there is such a thing as done, I will upload it to GitHub. A bit about the bash scriptThe bash script is broken into three files: variables, functions and main; also it has over 600 lines. I transferred the python way of thinking over to bash; or should I say the OOP style over to bash?","link":"/2019/08/14/pythonatnight/"},{"title":"I forgot why I needed this","text":"Remove all files in the master branch; without breaking the git history","link":"/2019/02/19/removeallfiles/"},{"title":"Returning the current shell","text":"I always used echo $SHELL to return the current shell. Going over some studying material I rediscovered echo $0. This positional parameter, $0, assigns the current shell into that shell variable.Try it: 1echo $0 #Result bash","link":"/2019/09/23/returningthecurrentshell/"},{"title":"Python installation","text":"I was having trouble with my python installation. This helped. beautifulsoup123pip3 install beautifulsoup4brew install pythonbrew link python3 Python 31234567brew rm pythonbrew rm python3rm -rf /usr/local/opt/pythonrm -rf /usr/local/opt/python3brew prunebrew install python3brew postinstall python3 Virtual environments12345mkdir ~/.virtualenvspython3 -m venv ~/.virtualenvs/myvenvsource ~/.virtualenvs/myvenv/bin/activatedeactivate .zshrc123export WORKON&lt;sub&gt;HOME&lt;/sub&gt;=\"$HOME/.virtualenvs\"export VIRTUALENVWRAPPER&lt;sub&gt;PYTHON&lt;/sub&gt;=/usr/local/bin/python3source /usr/local/bin/virtualenvwrapper.sh","link":"/2019/06/26/pythoninstallation/"},{"title":"I will settle for Icarus","text":"I like the layout. I would like to change some columns around but I will haveto add that to my todo list. Also, for the images, I am considering unsplash.The goal is to make my own account and use my own images via their api againtodo. Photo by Fabian Grohs","link":"/2019/06/23/settleforicarus/"},{"title":"Recording terminal commands","text":"","link":"/2019/08/15/recordingterminalcommands/"},{"title":"Smaller macOS launchpad icons","text":"Making springboard show smaller icons. 123defaults write com.apple.dock autohide-time-modifier -int 0;killall Dockdefaults write com.apple.dock springboard-rows -int 8defaults write com.apple.dock springboard-columns -int 8;killall Dock Photo by Markus Spiske","link":"/2019/06/06/smallericons/"},{"title":"Site cleanup","text":"Cleaned up some tags, and categories. I wanted to move the personal category to the bottom but I honestly couldn’t decide on a word. Actually, I just came up with the word unique for the new category. It is not at the bottom but it works for me.","link":"/2019/07/11/sitecleanup/"},{"title":"So many flash cards","text":"The flash cards are piling up!","link":"/2019/10/17/somanyflashcards/"},{"title":"So many stashes","text":"git add . &amp;&amp; git stash all night long. Photo by Fabian Grohs","link":"/2019/06/21/somanystashes/"},{"title":"Slow month","text":"It has been a slow month. I haven’t done much python, or bash, or reading. So what have I been up to? Studying for the new compTIA Linux+ XK0-004. Everything has been dropped and put on the back burner for now. If I do post something it should be about something I learned in my studies.","link":"/2019/09/17/slowmonth/"},{"title":"So many libraries","text":"So many libraries, so little time. I suppose this is my new month post. I spent some time digging around some libraries. Which ones? 123import re, io , os, argparse, requests, subprocessfrom PIL import Image, ImageDraw, ImageFilter, ImageFontfrom shutil import copyfile","link":"/2019/09/01/somanylibraries/"},{"title":"Supermicro configuration","text":"Create a Bootable USB From a working Linux distribution Download an ISO image from Debiandebian-9.7.0-amd64-netinst.iso was used for this project In terminal type: cd ~/Downloads # Or wherever you downloaded the iso image. dmesg | grep USB # Take note of the device path: /dev/sgb # Yours might be different. dd if=debian-9.7.0-amd64-netinst.iso of=/dev/sgb; sync sync # Once last time. Server Hardware Specifications Motherboard - X7DBR Processor - Xeon L5420 @ 2.50GHz; Socket LGA771 Memory - 32GB Hard Disk - 4 x 1 TB RAID Controller - 3ware Inc 9550SX SATA-II RAID PCI-X Setting up Server BIOS BIOS Tip: Press x to activate and deactivate; BIOS only allows up to 8 devices. deactivate one in order to activate another one. press x to delete entries and add boot usb boot from usb Enter BIOS and enable USB booting. Use the BIOS tips above to complete this step. Setting up Server RAID Used a mirror raid setup 2TB mirror on /dev/sda 2TB mirror on /dev/sdb Installation Plug in USB; Power on; Follow installation prompts. Debian GNU/Linux installer boot menu Select Install Select a language Select your location Configure the keyboard Configure the network Hostname Domain name Set up users and passwords Root password reenter password non-administrative account Full name Username password reenter password Configure the clock Partition disks Partitioning method Select: Guided - use entire disk Select disk to partition Select: sda Partitioning scheme Select: All files in one partition (recommended for new users) Finish partitioning and write changes to disk Write the changes to disks? Select: Yes Configure the package manager Scan another CD or DVD Select: No Debian archive mirror country Select: your country Debian archive mirror Select: your choice: Choose one in your country HTTP proxy information (blank for none) Configuring popularity-contest Participate in the package usage survey? Select: your choice: Yes or No Software selection Deselect: Debian desktop environment Dselect: print server Select: ... LXDE Select: SSH server Leave standard system utilities selected Grub Select: /dev/sda Reboot Create User Accounts Log-in as root In console type: adduser tuxEnter new Unix passwordUser information: Full name, Work number etc. System Packages Install vim backspace support, sudo, autossh, vnc, tmux, virt-manager, UFW In console type: sudo apt install \\ vim-nox sudo autossh vnc4server \\ xvnc4viewer ssvnc tmux virt-manager ufwEdit Configuration FilesIn console type: vi /etc/default/grubIn vi type: # this disables the graphical login - use startx to start xwindows # vi /etc/default/grub change to GRUB_CMDLINE_LINUX_DEFAULT=&quot;text&quot; update-grub systemctl set-default multi-user.targetsave and exit with :x In console type: vi /etc/bin/upitIn vi type: #!/bin/bash # upit - here is the update script - also for future reference # to fix the repos #dpkg --configure -a #apt-get -f install # run the update upgrade apt-get check apt-get clean apt-get update apt-get -y upgrade # warning - will update kernels ... apt-get -y dist-upgrade apt-get -y autoclean apt-get -y autoremove lsb_release -a cat /proc/versionsave and exit with :x In console type: vi /etc/default/grubIn vi edit: GRUB_CMDLINE_LINUX=&quot;console=tty0 console=ttyS0,115200n8&quot;save and exit with :x System Configuration Commands Enable the getty for COM1 In console type: usermod -aG sudo,libvirt,netdev tux update-grub; systemctl enable serial-getty@ttyS0.service; systemctl start serial-getty@ttyS0.service; systemctl deamon-reload; systemctl enable serial-getty@ttyS0.service systemctl start serial-getty@ttyS0.service systemctl daemon-reloadUSB Serial on Windows On windows 10 used putty; already installed. Putty on Windows 10 Open windows Device Manager Under ports; look for serial to USB What is your COMM PORT? Mine reads COM6. Open Putty Under Connection Type; Click radio button Serial Set Baud speed to 115200; Click Open If everything is correct it will show the linux login prompt on the client. USB Serial on Linux Linux Notes for Serial USB Serial F/F NM Serial USB Connect USB to USB sudo chmod 777 /dev/ttyUSB0sudo screen /dev/ttyUSB0 115200dmesg | grep ttyUSBsudo chmod 777 /dev/ttyUSB0sudo chmod 777 /dev/ttyUSB1sudo screen /dev/ttyUSB0 115200 COM A 115200 RTS/CTS On The Client Machine On the console type: dmesg # to find usb ttyUSBxchmod 777 /dev/ttyUSBxscreen /dev/ttyUSBx 115200 Setting Up The Reverse TunnelIn console type: vi /etc/systemd/system/rc-local.serviceIn vi type: [Unit] Description=/etc/rc.local ConditionPathExists=/etc/rc.local [Service] Type=forking ExecStart=/etc/rc.local start TimeoutSec=0 StandardOutput=tty RemainAfterExit=yes SysVStartPriority=99 [Install] WantedBy=multi-user.targetsave and exit with :x In console type: vi /etc/rc.localIn vi type: #!/bin/sh -e #sleep 30 #tmux new-session -d -s &quot;tunnel&quot; &quot;bash /home/tux/tunnel.sh&quot; su - tux -c &quot;autossh -N -f -R 2222:127.0.0.1:22 username@hostname&quot; exit 0save and exit with :x In console type: sudo chmod +x /etc/rc.localIn console type: sudo systemctl enable rc-local.serviceSetting up VNC Server On server In console type: vi ~/.vnc/startvncIn vi type: #!/bin/bash xrdb $HOME/.Xresources xsetroot -solid grey ## Fix to make GNOME work export XKL_XMODMAP_DISABLE=1 /etc/X11/Xsession lxterminal &amp; /usr/bin/lxsession -s LXDE &amp;save and exit with :x In console type: vi ~/.vnc/stopvncIn vi type: vncserver -kill :1save and exit with :x In console type: chmod +x ~/.vnc/startvncIn console type: xvncserverType in a passwordWould you like to enter a view-only password (y/n)? n VNC as a Systemd Service Thanks to spinxz In console type: sudo vi /etc/systemd/system/vncserver@.serviceIn vi type: # Vncserver service file for Debian or Ubuntu with systemd # # Install vncserver and tools # e.g. apt-get install tightvncserver autocutsel gksu # # 1\\. Copy this file to /etc/systemd/system/vncserver@1.service # 2\\. Edit User= # e.g &quot;User=paul&quot; # 3\\. Edit the vncserver parameters appropriately in the ExecStart= line! # e.g. the -localhost option only allows connections from localhost (or via ssh tunnels) # 4\\. Run `systemctl daemon-reload` # 5\\. Run `systemctl enable vncserver@:&lt;display&gt;.service` # [Unit] Description=Remote desktop service (VNC) After=syslog.target network.target [Service] Type=forking User=&lt;username&gt; # Clean any existing files in /tmp/.X11-unix environment ExecStartPre=/bin/sh -c &apos;/usr/bin/vncserver -kill %i &gt; /dev/null 2&gt;&amp;1 || :&apos; #ExecStart=/usr/bin/vncserver -geometry 1800x1000 -depth 16 -dpi 120 -alwaysshared -localhost %i ExecStart=/usr/bin/vncserver -xstartup /home/&lt;username&gt;/.vnc/startvnc ExecStop=/usr/bin/vncserver -kill %i [Install] WantedBy=multi-user.targetIn console type: sudo systemctl daemon-reload sudo systemctl enable vncserver@1.service sudo systemctl start vncserver@1.serviceUFWIn console type: sudo ufw allow ssh sudo ufw allow www sudo ufw allow 443/tcp sudo ufw allow 5901/tcp sudo ufw allow 2222/tcp sudo ufw status sudo ufw enableSetting up SSH Jumps From a working Linux distribution In console type: vi ~/.ssh/configIn vi type: Host firstHop Hostname x.x.x.x User username IdentityFile ~/.ssh/firstHop-id_rsa Host secondHop Hostname x.x.x.x ForwardX11 yes User username IdentityFile ~/.ssh/secondHop-id_rsa ProxyCommand ssh firstHop -W %h:%p Host thirdHop Hostname 127.0.0.1 User username IdentityFile ~/.ssh/thirdHop-id_rsa ProxyCommand ssh secondHop -W %h:%p Port 2222 LocalForward 5991 127.0.0.1:5901save and exit with :x # make three keys firstHop, secondHop and thirdHop ssh-keygen -t rsa #firstHop cat firstHop-id_rsa.pub | ssh firstHop &apos;cat &gt;&gt; .ssh/authorized_keys&apos; ssh firstHop; ssh-keygen -t rsa # secondHop cat secondHop-id_rsa.pub | ssh secondHop &apos;cat &gt;&gt; .ssh/authorized_keys&apos; ssh secondHop; ssh-keygen -t rsa #thirdHop cat thirdHop-id_rsa.pub | ssh thirdHop &apos;cat &gt;&gt; .ssh/authorized_keys&apos; Copy all private keys to your working Linux distro ssh-add ~/.ssh/{first,second,third}Hop{1,2,3}VNC From a working Linux distribution In console type: ssh thirdHopEnter secondHop passwordEnter thirdHop passwordOnce connectedOpen your VNC clientType 127.0.0.1:5991 KVM/LXC/LXD/QEMU Creating VM’s - make sure BIOS is enabled for virtual machine With LXDE available via VNC, go to the main menu. Click System ToolsClick Virtual Machine ManagerClick Create a new virtual machineChoose Local install media (ISO image or CDROM)Click ForwardClick Browse and Choose your ISO imageClick ForwardChoose CPU and Memory AllocationClick ForwardChoose Storage AmountClick ForwardClick Finish Photo by Stef Westheim","link":"/2019/06/26/supermicro/"},{"title":"The new but now old posting script","text":"My little “Secret” Actually, this script has been abandon for something a little more … involved. Currently working on it. How involved? Emacs, Org mode, Jekyll, GitHub, and some custom Elisp. This one might take awhile. Update: Emacs will be used on my personal computer but I am looking for a new method… again.","link":"/2019/05/09/thenewnowold/"},{"title":"So many ways to save","text":"I knew about wq, x and only rediscovered ZZ when going over the text editor chapters. #Linux+, #vi, #vim? 123:x:ZZ:wq","link":"/2019/10/02/somanywaystosave/"},{"title":"Three errors","text":"Spring cleaning, Summer air out, Fall sweeping? This site has three errors: dead URL links which read 404. I find it very strange because the on the development server everything is up and running. I suppose it’s a perfect time to say “it works on my machine!”. Maybe a force update will help it recover because I am at a complete lost on this one. Checklist The html is present The hyperlink is correct It works on the development server Force update? UpdateForce update didn’t work. I figured it would have no effect since all I was doing is uploading the same error. Since everything is working on the dev server, I had to look for clues. I came up with Capitalization. The post that were causing errors had capitals in their URLs. I gave all of them lower case names. Ideally, I would like to rename all the URLs into something more simple; keeping the date and only changing the long winded path names. Why not now? Because I don’t want to mess with googles indexing. Maybe I should do it now and have google re-index the site map now than later. Also, changing some script code in the process. Sure why not. Can I do it all before the next day? After reviewing what needs to be done. I would rather not rush it. Hexo stores all the files in one directory. I can’t have multiple files with the same name. I will have to create I file checker before each new entry. I plan this out. Checklist Leave current file names Create a file checker; each new entry; one word paths?","link":"/2019/10/29/threeerrors/"},{"title":"This week python","text":"I feel that my python is getting a little rusty. So, I am in the process of moving some of my bash scripts into python — ‘scripts’?","link":"/2019/07/18/thisweekpython/"},{"title":"Tunnel here. tunnel there. reverse that","text":"Access VNC from far away. 12345678910111213141516Host firstHop Hostname x.x.x.x User username IdentityFile ~/.ssh/firstHop-id_rsaHost secondHop Hostname x.x.x.x User username IdentityFile ~/.ssh/secondHop-id_rsa ProxyCommand ssh firstHop -W %h:%pHost thirdHop Hostname 127.0.0.1 User username IdentityFile ~/.ssh/thirdHop-id_rsa ProxyCommand ssh secondHop -W %h:%p Port xxxx LocalForward xxxx 127.0.0.1:5901","link":"/2019/03/01/tunneltunnel/"},{"title":"Using ncurses","text":"I got tired of typing in my categories. So, I created a menu based on my categories with ncurses. This way I can select a category from a menu. Cool! ncurses for bash — dialogHere is the case statement. 1234567891011121314151617181920212223242526272829303132333435363738394041case \"$menu_choices\" in 1) menu_choices=`dialog --stdout --menu 'Please pick a category' 0 0 0 1 hardware 2 languages` if [ $menu_choices == 1 ]; then category_choices=\"computer, hardware\" else category_choices=\"computer, languages\" fi ;; 2) menu_choices=`dialog --stdout --menu 'Please pick a category' 0 0 0 1 linux 2 macos 3 windows` if [ $menu_choices == 1 ]; then category_choices=\"os, linux\" elif [ $menu_choices == 2 ]; then category_choices=\"os, macos\" else category_choices=\"os, windows\" fi ;; 3) menu_choices=`dialog --stdout --menu 'Please pick a category' 0 0 0 1 shell` if [ $menu_choices == 1 ]; then category_choices=\"terminal, shell\" fi ;; 4) menu_choices=`dialog --stdout --menu 'Please pick a category' 0 0 0 1 thought` if [ $menu_choices == 1 ]; then category_choices=\"unique, thought\" fi ;; 5) menu_choices=`dialog --stdout --menu 'Please pick a category' 0 0 0 1 updates` if [ $menu_choices == 1 ]; then category_choices=\"website, updates\" fi ;; *) echo \"exit\" ;;esac","link":"/2019/08/04/usingncurses/"},{"title":"Too much fun","text":"I couldn’t resist. What can I say — I’m weak!: I setup a GNS3 network topology! For some context, I will explain how this happened. I started reading about something called CCNA Routing and Switching (Cisco Certified Network Associate). I seen some videos of people using a virtual network simulator called GNS3. Call it fate, coincidence or a small world but I was working with Python and pyQT just last week; GNS3 is built with python and pyQT. I didn’t feel the need to write about what I was working on because it was, and still is, an experimental side project for this site. I am still using dialog for bash, and some python; and right now, it is still a spaghetti of a mess that I am scared to touch at the moment. So, I decided to relieve some stress and connect a router, switch and two computers. Simple enough, right? SummarySo far I’m trying to juggle bash, python, pyQT, Linux+, and now CCNA? If I were to rate which one is considered play and which is considered work I would say, from play to work, networking (because I love hardware — I think), GNU/Linux then Programming. I will be honest. I am lazy. I hate working hence why my programming is always — infinity=∞; sleep $infinity? I claimed I would drop everything and only work/play (it is work/play because it is in the middle of my rating system) for the Linux+ exam but failed to balance it all this week. To justify my networking play, I suppose it could be viewed as a little reward for working so hard; and if that is the case, I should probably get back to studying “working” so I can accrue more playing time.","link":"/2019/09/27/toomuchfun/"},{"title":"Variables","text":"Environment, shell, user and local variables. An important rule I learned today is how to name local variables; always use a lower case naming convention to avoid overwriting environment or shell variables.","link":"/2019/09/24/variables/"},{"title":"Windows Server 2003-2019 serial-USB possible?","text":"In the Debian server project, I used a serial to USB to make a headless connection. Great for disastrous — situations; Or when I have go searching for a keyboard, monitor, and mouse. YUCK! I thought to myself. Is this possible in Windows? Take a Windows server, crash it badly such as a BSOD or not, and connect to it from a client via serial? Tools Used RS-232 M (Male) to USB (Male) null modem M/F (Male/Female) On Windows Serverenter this on command line with Admin rights (Serial Side)bcdedit /bootems {default} ONbcdedit /emssettings EMSPORT:1 EMSBAUDRATE:115200 Make sure Special Administrator Console is on Automatic in Services. (mine was off and kept shutting off when I tried to run it.)And famously reboot. On client (USB Side)I wouldn’t chmod 777; chown on the device or use it as root.Or add a group for that device. This was used for testing. sudo chmod 777 /dev/ttyUSB0 screen cu -l /dev/ttyUSB0 -s 115200 All the power{shell} of Windows. Is it useful in 2019 or in Windows Server 2019? I’m not sure but it works on Window Server 2016.","link":"/2019/03/14/windowsconsole/"},{"title":"Wondering about images","text":"I have been reading about OpenCV. I would like to learn more about it so I can build some sort of neural network. Ideally, I would like to record plants growing. Details later.","link":"/2019/08/29/wonderingaboutimages/"},{"title":"Website outrage","text":"Major site outrage. A huge special thanks to git! I was able to recover. Also, today I started using long commit messages on the development server. I was adding comments into the scripts but figured it was starting to look ugly; that and I was adding dates manually. Git can take care of all of that in the git logs. I’m actually scared to look at the git logs. I have so many commits it is not even funny; that and it is automated, so you know it is long. On second thought, let me peak. git log --oneline| wc -l only 43 commits… not too bad. I will rebase later. The only thing that concerns me is if the longer commits will get lost in the shuffle.","link":"/2019/07/11/websiteoutrage/"},{"title":"Explosion of files","text":"I had files that were exploded across the filesystem. My goal was to find them all.","link":"/2019/10/29/explosionoffiles/"},{"title":"Booting with MDT","text":"I got a chance to deploy my first pxe-boot installation. I installed Windows 10 Enterprise on a Hyper-V virtual machine. I would try it on a bare bone but the current set up is complicated: wifi, shared internet over thunderbolt, cross over cable. I guess what I am trying to say is that it is not connected to a switch? Wait! I just disconnect the Ethernet and connect the test unit. Maybe later. I will document my notes on a new menu link above. I am thinking of calling it Windows and you will find it at the top soon. Yes, I would like consider myself a GNU/Linux guy but it seems like I’m “forced” to toggle all three: Unix/Unix-like(macOS, FreeBSD), GNU/Linux, Windows.","link":"/2019/10/02/workingwithmdt/"},{"title":"I gave into temptation","text":"What can I say — I gave into temptation: dropped all my OpenCV reading to play with docker-machine. image below","link":"/2019/09/04/workingwithdockeronwindows/"},{"title":"A new framework, a new site","text":"I been thinking about the layout of the default jekyll theme. I wanted to list all my tags and change the font sizes. I wanted some tags with alternating fonts sizes. I did not know why some tags have a larger fonts and why some have a smaller fonts until I ran across Hexo. It seems like the more tags associated with that tag will have a bigger font: have ten tags under bash? Then size 10 font for the bash tag. Five tags under shell? Size 5 for shell tag. I love it.","link":"/2019/06/20/anewframework/"},{"title":"New month post","text":"Just finished up on aliases and environment variables. Moving on to shell configuration and command redirection. I might order the compTIA certmaster learn for Linux+. I feel like my studying is going fine but after reviewing their program layout, I might be able to speed up the process if I use their program.","link":"/2019/11/01/newmonthpost/"}],"tags":[{"name":"unsplash","slug":"unsplash","link":"/tags/unsplash/"},{"name":"api","slug":"api","link":"/tags/api/"},{"name":"thought","slug":"thought","link":"/tags/thought/"},{"name":"distro","slug":"distro","link":"/tags/distro/"},{"name":"debian","slug":"debian","link":"/tags/debian/"},{"name":"console","slug":"console","link":"/tags/console/"},{"name":"cpp","slug":"cpp","link":"/tags/cpp/"},{"name":"c","slug":"c","link":"/tags/c/"},{"name":"preseed","slug":"preseed","link":"/tags/preseed/"},{"name":"simple-cdd","slug":"simple-cdd","link":"/tags/simple-cdd/"},{"name":"scripting","slug":"scripting","link":"/tags/scripting/"},{"name":"bash","slug":"bash","link":"/tags/bash/"},{"name":"hexo","slug":"hexo","link":"/tags/hexo/"},{"name":"espinz","slug":"espinz","link":"/tags/espinz/"},{"name":"Linux","slug":"Linux","link":"/tags/Linux/"},{"name":"Ubuntu","slug":"Ubuntu","link":"/tags/Ubuntu/"},{"name":"compTIA","slug":"compTIA","link":"/tags/compTIA/"},{"name":"Linux+","slug":"Linux","link":"/tags/Linux/"},{"name":"python","slug":"python","link":"/tags/python/"},{"name":"JavaScript","slug":"JavaScript","link":"/tags/JavaScript/"},{"name":"command","slug":"command","link":"/tags/command/"},{"name":"git","slug":"git","link":"/tags/git/"},{"name":"shell","slug":"shell","link":"/tags/shell/"},{"name":"swift","slug":"swift","link":"/tags/swift/"},{"name":"js","slug":"js","link":"/tags/js/"},{"name":"kde","slug":"kde","link":"/tags/kde/"},{"name":"gnome","slug":"gnome","link":"/tags/gnome/"},{"name":"internet","slug":"internet","link":"/tags/internet/"},{"name":"coaxial","slug":"coaxial","link":"/tags/coaxial/"},{"name":"cable","slug":"cable","link":"/tags/cable/"},{"name":"splitter","slug":"splitter","link":"/tags/splitter/"},{"name":"jupyter","slug":"jupyter","link":"/tags/jupyter/"},{"name":"jekyll","slug":"jekyll","link":"/tags/jekyll/"},{"name":"plasma","slug":"plasma","link":"/tags/plasma/"},{"name":"zsh","slug":"zsh","link":"/tags/zsh/"},{"name":"lsd","slug":"lsd","link":"/tags/lsd/"},{"name":"icarus","slug":"icarus","link":"/tags/icarus/"},{"name":"javascript","slug":"javascript","link":"/tags/javascript/"},{"name":"ejs","slug":"ejs","link":"/tags/ejs/"},{"name":"recterm","slug":"recterm","link":"/tags/recterm/"},{"name":"ttyrec","slug":"ttyrec","link":"/tags/ttyrec/"},{"name":"ttygif","slug":"ttygif","link":"/tags/ttygif/"},{"name":"macOS","slug":"macOS","link":"/tags/macOS/"},{"name":"launchpad","slug":"launchpad","link":"/tags/launchpad/"},{"name":"libraries","slug":"libraries","link":"/tags/libraries/"},{"name":"supermicro","slug":"supermicro","link":"/tags/supermicro/"},{"name":"server","slug":"server","link":"/tags/server/"},{"name":"vim","slug":"vim","link":"/tags/vim/"},{"name":"vi","slug":"vi","link":"/tags/vi/"},{"name":"network","slug":"network","link":"/tags/network/"},{"name":"Bash","slug":"Bash","link":"/tags/Bash/"},{"name":"hardware","slug":"hardware","link":"/tags/hardware/"},{"name":"powershell","slug":"powershell","link":"/tags/powershell/"},{"name":"serial","slug":"serial","link":"/tags/serial/"},{"name":"usb","slug":"usb","link":"/tags/usb/"},{"name":"opencv","slug":"opencv","link":"/tags/opencv/"},{"name":"raspberry pi","slug":"raspberry-pi","link":"/tags/raspberry-pi/"},{"name":"linux","slug":"linux","link":"/tags/linux/"},{"name":"find","slug":"find","link":"/tags/find/"},{"name":"MDT","slug":"MDT","link":"/tags/MDT/"},{"name":"Microsoft","slug":"Microsoft","link":"/tags/Microsoft/"},{"name":"docker","slug":"docker","link":"/tags/docker/"},{"name":"docker-machine","slug":"docker-machine","link":"/tags/docker-machine/"},{"name":"windows","slug":"windows","link":"/tags/windows/"}],"categories":[{"name":"website","slug":"website","link":"/categories/website/"},{"name":"unique","slug":"unique","link":"/categories/unique/"},{"name":"os","slug":"os","link":"/categories/os/"},{"name":"updates","slug":"website/updates","link":"/categories/website/updates/"},{"name":"computer","slug":"computer","link":"/categories/computer/"},{"name":"thought","slug":"unique/thought","link":"/categories/unique/thought/"},{"name":"terminal","slug":"terminal","link":"/categories/terminal/"},{"name":"linux","slug":"os/linux","link":"/categories/os/linux/"},{"name":"macos","slug":"os/macos","link":"/categories/os/macos/"},{"name":"languages","slug":"computer/languages","link":"/categories/computer/languages/"},{"name":"shell","slug":"terminal/shell","link":"/categories/terminal/shell/"},{"name":"hardware","slug":"computer/hardware","link":"/categories/computer/hardware/"},{"name":"windows","slug":"os/windows","link":"/categories/os/windows/"},{"name":"compTIA","slug":"compTIA","link":"/categories/compTIA/"},{"name":"Linux+","slug":"compTIA/Linux","link":"/categories/compTIA/Linux/"}]}